-- =========================================
-- Задания на дом по SQL (Вариант 22: Автомобили)
-- Студент: Бармин Рустам Тарланович
-- Дата: 29.09.2026
-- =========================================

-- Задание 1. Самый дорогой товар (Автомобиль)
SELECT марка, модель, цена FROM Товар ORDER BY цена DESC LIMIT 1;

-- Задание 2. Самый дешёвый товар (Автомобиль)
SELECT марка, модель, цена FROM Товар ORDER BY цена ASC LIMIT 1;

-- Задание 3. Товары одной категории (Например, марки Honda)
SELECT марка, модель, цена FROM Товар WHERE марка = 'Honda';

-- Задание 4. Поиск по названию (Машины, в модели которых есть буква "а")
SELECT марка, модель FROM Товар WHERE модель LIKE '%a%';

-- Задание 5. Все заказы
SELECT id, дата, клиент, товар_id, количество FROM Заказ;

-- Задание 6. Заказы конкретного клиента
SELECT * FROM Заказ WHERE клиент = 'Иванов Иван Иванович';

-- Задание 7. JOIN — заказы с названиями автомобилей
SELECT Заказ.дата, Заказ.клиент, Товар.марка, Товар.модель, Заказ.количество
FROM Заказ
    JOIN Товар ON Заказ.товар_id = Товар.id;

-- Задание 8. Общая сумма всех заказов
SELECT SUM(Товар.цена * Заказ.количество)
FROM Заказ
    JOIN Товар ON Заказ.товар_id = Товар.id;

-- Задание 9. Количество заказов по клиентам
SELECT клиент, COUNT(*) FROM Заказ GROUP BY клиент;

-- Задание 10. Свой запрос
-- Что хочу получить: Вывести машины, у которых остаток на складе больше 2 штук
SELECT марка, модель, количество
FROM Товар
WHERE
    количество > 2
ORDER BY количество DESC;