-- =========================================
-- Задания на дом по SQL
-- Студент: Бармин Рустам
-- Дата: 29.09.2026
-- =========================================

-- Задание 1. Самый дорогой товар
SELECT название, цена FROM Товар ORDER BY цена DESC LIMIT 1;

-- Задание 2. Самый дешёвый товар
SELECT название, цена FROM Товар ORDER BY цена ASC LIMIT 1;

-- Задание 3. Товары категории «Кроссовки»
SELECT название, цена FROM Товар WHERE категория = 'Кроссовки';

-- Задание 4. Поиск по названию (товары с буквой "о")
SELECT название FROM Товар WHERE название LIKE '%о%';

-- Задание 5. Все заказы
SELECT id, дата, клиент, товар_id, количество FROM Заказ;

-- Задание 6. Заказы клиента «Иванов Иван Иванович»
SELECT * FROM Заказ WHERE клиент = 'Иванов Иван Иванович';

-- Задание 7. JOIN — заказы с названиями товаров
SELECT Заказ.дата, Заказ.клиент, Товар.название, Заказ.количество
FROM Заказ
    JOIN Товар ON Заказ.товар_id = Товар.id;

-- Задание 8. Общая сумма всех заказов
SELECT SUM(Товар.цена * Заказ.количество)
FROM Заказ
    JOIN Товар ON Заказ.товар_id = Товар.id;

-- Задание 9. Количество заказов по клиентам
SELECT клиент, COUNT(*) FROM Заказ GROUP BY клиент;

-- Задание 10. Свой запрос
-- Что хочу получить: Список всех уникальных брендов обуви
SELECT DISTINCT производство FROM Товар ORDER BY производство;